Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh686-v3.tmx
Source language: bo
Languages: en

source: སྨན་ནོར་བུ་དང་། གསང་སྔགས་དང་། དཀྱིལ་འཁོར་དང་། ཕྱག་རྒྱའི་མཐུ་དེས་ཕྱི་མའི་དུས་ཕྱི་མའི་ཚེ་ན་རིག་སྔགས་འཆང་རྣམས་ཀྱི་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་རིགས་ཀྱི་དམ་ཚིག་སྤྱིའི་གསང་བའི་དཀྱིལ་འཁོར་རྣམ་པ་སྣ་ཚོགས་སྒྱུ་མ་ལྟ་བུའི་ངོ་བོ་ཉིད་བསྟན་པ་ཡང་དག་པར་སྟོན་པར་མཛད། བཀླགས་པས་གྲུབ་པ།
en: By the power of this medicinal jewel and of the mantras, maṇḍala, and mudrā, the vidyā holders will perceive, in the final time of the final period, the secret samaya maṇḍala shared by all tathāgata families, with its various, illusion-like forms and appearances.

source: རིགས་ཀྱི་དམ་ཚིག་སྤྱིའི་གསང་བ་ཐམས་ཅད་དུ་ཉེ་བར་སྟོན་པར་མཛད་དོ།
en: When accomplished through study, this rite will completely create the secret family samaya bond equally with all the tathāgatas.

source: །རིག་སྔགས་འཆང་རྣམས་ཀྱི་ངལ་བ་འབྲས་བུ་མེད་པ་གཞན་དུ་འགྱུར་བ་མེད་དོ། །ངལ་བ་དང་།
en: A vidyā holder’s toil will not lead to other fruitless things.

source: དུབ་པ་དང་། འབད་པའི་བཟླས་བརྗོད་ཀྱི་ཆོ་ག་འབྲས་བུ་མེད་པར་མི་འགྱུར་བར་བྱ་བའི་ཕྱིར་རང་གི་སེམས་ཀྱི་རྒྱུད་དད་པ་དང་། གུས་པ་དང་། གསང་ཆེན་དང་། གསང་བར་བྱ་བ་གཞན་ལ་བསྟན་པར་མི་བྱ་སྟེ།
en: In order that your toil, effort, training, and recitation practice are not in vain, you must develop faith and respect in your mindstream and never reveal what is secret.

source: དངོས་གྲུབ་མེད་པར་མི་འགྱུར་རོ།
en: Do not end up without accomplishment! “

source: །དེ་ལྟ་བས་ན་གསང་སྔགས་སྒྲུབ་པ་ནི་ཤིན་ཏུ་གསང་བར་བྱ་ཞིང་ལེགས་པར་སྨྱུང་བ་བྱས་ལ་འབད་པར་བྱ།
en: Accordingly, the mantra practice must be taken seriously.

source: །ཁ་ཟས་ངན་པ་སྤང་བར་བྱ། གོས་ངན་པ་དང་། སེམས་ངན་པ་ཡང་ཡོངས་སུ་སྤང་བར་བྱ། མི་སྲུན་པ་དང་། མི་བདེན་པ་དང་། ཕྲ་མ་དང་།
en: The vidyā holder should scrupulously observe the ritual fast and avoid inappropriate foods, inappropriate clothing, and, above all, wrong friends, such as evil people who tell lies or slander others, people who have a corrupting influence, or people who steal mantras, rites, mudrās, or maṇḍalas.

source: སེམས་ཅན་སུན་འབྱིན་པར་བྱེད་པ་དང་། གསང་སྔགས་རྐུ་བ་དང་། ཆོ་ག་ཞིབ་མོ་རྐུ་བར་བྱེད་པ་དང་། ཕྱག་རྒྱ་དང་།
en: He should not associate with them under any circumstances.

source: དཀྱིལ་འཁོར་རྐུ་བར་བྱེད་པ་དེ་དག་གི་རྟོགས་པ་ནི་གང་ན་ཡང་མེད་དེ། དུས་གསུམ་གྱི་མགོན་པོས་སྨད་ཅིང་བྱང་ཆུབ་སེམས་དཔས་ཀྱང་སྨད་ལ། མགོན་པོ་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གིས་ཀྱང་སྨད་པ་ཡིན་ནོ།
en: Such wicked people criticize the teachings of the lords of the three times; they criticize even the bodhisattvas, including Lord Avalokiteśvara.

source: །སེམས་ཅན་སྡོང་དུམ་བསྲེགས་པ་འདི།
en: Such individuals burn the pillars that support them. “

source: །གསང་བ་སུན་འབྱིན་མ་རུངས་པ། །འཇིག་རྟེན་འདི་དང་ཕ་རོལ་ཏུ། །རྟག་ཏུ་སྨད་པར་བྱ་བ་ཡིན།
en: A bad person who reveals secrets will always be condemned both in this world and the next.

source: །ལྷ་རྣམས་ཀྱིས་ནི་ཡོངས་སུ་བཏང་། །མ་རུངས་པས་ནི་བདུད་ཀྱིས་ཟོས། །མ་རུངས་པས་ནི་བགེགས་ཀྱིས་ཟོས།
en: Such evil people are forsaken by deities, embraced by evil māras, and beset by obstacles.

source: །བསླབ་གཞི་ཚུལ་ཁྲིམས་ཉམས་པ་དང་། །མགོན་པོའི་བསྟན་པ་སུན་འབྱིན་པ། །དེ་ལ་དངོས་གྲུབ་ཇི་ལྟར་འབྱུང་།
en: How could such people be successful if they lack discipline, are insubordinate, and disparage the teachings of the teacher?

source: །དེ་ལ་སྐྱོབ་པ་གང་ཡང་མེད། །མགོན་མེད་ཀུན་ཏུ་སྨད་པ་ཡིན།
en: There is no protection of any kind for corrupt people; they are completely without a protector.

source: །དེ་བས་དེ་ལ་དངོས་གྲུབ་ནི། །ཆུང་ངུའང་མེད་ལ་ཉེས་པ་ཡིས།
en: It is therefore no fault of mine that they do not attain any accomplishment at all.

source: །གསང་སྔགས་དང་ནི་སྨན་མི་འགྲུབ།
en: They will neither accomplish the mantra nor obtain the medicinal substances.

source: །ཉེས་པ་དེ་དག་རང་གིས་བྱས། །གཞན་ཡང་མ་རུངས་བྱེད་པ་ཡིན།
en: Committing offenses themselves, they also bring ruin upon others. “

source: །དེ་བས་སེམས་ཅན་མཁས་ལ་སྦྱིན། །སློབ་པ་འདོད་ཅིང་ཡོན་ཏན་དགའ།
en: In view of this, the vidyā holder should be generous toward sentient beings by giving them alms and the things they desire.

source: །སྙིང་རྗེའི་བདག་ཉིད་བྱམས་ལ་གནས། །སེམས་ཅན་ཀུན་ལ་བརྩེ་བའི་མཆོག །དེ་ཡི་ལག་ཏུ་སྦྱིན་བྱ་སྟེ།
en: Filled with motherly love and compassion, he should make generosity for all beings his chief preoccupation; the supreme accomplishment will then fall into his hands.

source: །དེ་ཡི་དངོས་གྲུབ་བླ་ན་མེད། །གསང་བ་འདི་ནི་ཤིན་ཏུ་གསང་བ་ཡིན་ཏེ། འཇིག་རྟེན་དབང་ཕྱུག་གི་སྙིང་པོ་གསང་བ་དེ་ཡང་རིག་སྔགས་འཆང་རྣམས་ཀྱི་དེ་ཁོ་ན་ཉིད་ཀྱི་གསང་བ་དང་།
en: This supreme secret, the ultimate secret essence of the Lokeśvara, his secret nature, can easily be accomplished by vidyā holders.

source: གསང་སྔགས་དང་། ཕྱག་རྒྱ་སྒྲུབ་སླ་སྟེ། བཀླགས་པས་འགྲུབ་པ་དེ་བཞིན་དུ་སྨན་ནོར་བུ་འདི་ལ་རྟག་ཏུ་འཇུག་ཅིང་དངོས་གྲུབ་ཀྱི་དེ་ཁོ་ན་ཉིད་རབ་ཏུ་སྟོན་པར་བྱེད་པ་ཡིན་ནོ། །རིག་སྔགས་འཆང་ནི་བདག་ཉིད་ཀྱིས།
en: They should study and practice it along with its mantras and mudrās; by employing this medicinal jewel continually, they will manifest the signs of true accomplishment.

source: །མཆོག་ཏུ་གསང་བ་བསྒྲུབ་བྱ་བ།
en: One should accomplish this practice alone in utmost secrecy. “

source: །རིག་སྔགས་འཆང་ནི་གཙང་མ་ཡིས། །ཁྲུས་བྱས་གོས་གཙང་གྱོན་བྱེད་ལ། །འདིར་ནི་ཉིན་ཞག་སྨྱུང་བ་དང་། །དད་དང་གུས་པས་མཆོད་པ་བྱ། །དོན་ཡོད་འཁོར་ལོ་སྒྲུབ་བྱེད་པས།
en: The vidyā holder should purify himself ritually, bathe, put on clean clothes, observe the ritual fast day and night, and make offerings with faith and respect.

source: །དངོས་གྲུབ་དཀྱིལ་འཁོར་དམ་པ་བསྒྲུབ། །སྨན་སྤྲྀ་ཀ་དང་། ཙནྡན་གྱི་ཕྱེ་མ་དང་། ཨ་ག་རུ་དང་། པདྨ་གེ་སར་དང་།
en: He should first successfully perform the practice of the amogha circle, the supreme maṇḍala.

source: པདྨ་དང་། པདྨའི་ལྡུམ་བུ་དང་། པདྨའི་འདབ་མ་དང་། དེ་བཞིན་དུ་གིའུ་ཝང་དང་། ལྡོང་རོས་དང་།
en: He should procure equal parts fenugreek, powdered sandalwood, agarwood, the filaments, stalks, and petals of a lotus, bovine bezoar, realgar, champak, and sumanas.

source: ཙམ་པ་ཀ་དང་། སུ་མ་ན་སྟེ།
en: He should then combine them together and grind them into powder.

source: དེ་བཞིན་ཆ་ནི་མཉམ་སྦྱར་ཏེ། །ཕྱེ་མ་དག་ཏུ་བྱས་ནས་ནི། །དེ་ནས་དོན་ཡོད་རྒྱལ་པོ་ཡིས། །ཚེས་བརྒྱད་ནས་ནི་བཅྭ་ལྔའི་བར། །བརྒྱ་རྩ་བརྒྱད་དུ་བཟླས་བརྗོད་བྱ། །ཁྲོ་བོའི་རྒྱལ་པོས་བརྒྱ་རྩ་བརྒྱད།
en: He should incant the mixture with the Amogharāja one hundred and eight times on the eighth through the fifteenth lunar day and consecrate it by reciting the Krodharāja mantra one hundred and eight times. “

source: །བཟླས་བརྗོད་བྱས་ནས་དབང་བསྐུར་རོ། །དེའི་འོག་ཏུ་ཆ་ལྔར་བྱ་སྟེ། མིག་བསྐུ་བ་དང་། རིལ་བུ་དང་། ཕྱེ་མ་དང་།
en: He should then divide the mixture into five parts to be used respectively as an eye ointment, a pill, a powder, cooked oil, and a preparation used for rinsing the mouth and other ablutions.

source: ཏིལ་མར་ཚོས་པ་དང་ཁ་གདོང་བཀྲུ་ཞིང་ཁྲུས་བྱའོ། །མིག་སྨན་ནི་སོའུ་བྱི་རེ་དང་ལྷན་ཅིག་སྦྲུས་ལ་དོན་ཡོད་པའི་རྒྱལ་པོས་བརྒྱ་སྟོང་བཟླས་བརྗོད་བྱའོ།
en: To make the eye ointment, he should blend the mixture with antimony and incant it with the Amogharāja one hundred and eight times.

source: །རིལ་བུ་ནི་སྦྲང་རྩི་དཀར་པོ་དང་ལྷན་ཅིག་སྦྲུའོ།
en: To make the pill, he should blend the mixture with sugar and honey.

source: །ཕྱེ་མ་ནི་འཇིག་རྟེན་དབང་ཕྱུག་ལ་ཕུལ་བའི་མེ་ཏོག་དང་ལྷན་ཅིག་སྦྲུའོ།
en: To make the powder, he should blend the mixture with flowers that have been offered to the Lokeśvara.

source: །ཏིལ་མར་བཙོས་པ་ནི་བྲཏྤ་ཏི་ལ་སྟེ།
en: To make the cooked oil, he should blend the mixture with brāhmī oil.

source: ཤིང་པ་ལ་ཤའི་མར་དང་ལྷན་ཅིག་སྦྲུའོ། །ཁ་གདོང་བཀྲུ་བ་ནི་ཙནྡན་དཀར་པོའི་ཆུ་དང་ལྷན་ཅིག་སྦྲུ་ཞིང་སུ་མ་ན་དང་། གུར་གུམ་དང་།
en: To make the mouth rinse, he should blend the mixture with sandalwood sap and, additionally, with sumanas, saffron, and scented water.

source: སྤོས་ཆུས་ལྷན་ཅིག་སྦྲུས་ལ་སོ་སོར་བརྒྱ་རྩ་བརྒྱད་ཟླས་བརྗོད་བྱ། ཁྲོ་བོའི་རྒྱལ་པོས་ཉི་ཤུ་རྩ་གཅིག་བཟླས་བརྗོད་བྱས་ནས་དབང་བསྐུར་བར་བྱའོ།
en: He should incant each of the five parts individually with the Amogharāja one hundred and eight times and consecrate it by reciting the Krodharāja mantra twenty-one times. “

source: །དེ་ནས་རིག་སྔགས་འཆང་ཉིན་ཞག་གཅིག་སྨྱུང་བ་བྱས་པས་གཅིག་ཏུ་སྦྲུས་ཏེ། །དངུལ་གྱི་སྣོད་ཀྱི་ནང་དུ་བཅུག་ལ་སོ་སོར་བརྒྱ་རྩ་བརྒྱད་བཟླས་བརྗོད་བྱས་ནས་ཤར་ཕྱོགས་ཀྱི་སྒོ་ནས་དཀྱིལ་འཁོར་དུ་གཞག་པར་བྱ་སྟེ།
en: After fasting for one day and night, he should place the five parts together, incant them one hundred and eight times with the Amogharāja, and place them in the maṇḍala in individual silver bowls.

source: དཀྱིལ་འཁོར་མཆོག་ལ་ཕྱག་དང་བསྐོར་བ་བྱས་ལ་དེ་ནས་སོ་སོར་དར་གྱིས་ཁ་བཅད་དེ།
en: He should bow to the supreme maṇḍala at the eastern door and circumambulate it clockwise in a full circle, distributing the bowls separately.

source: དཀྱིལ་འཁོར་གྱི་སྙིང་པོར་བཞག་ལ་དོན་ཡོད་པའི་རྒྱལ་པོ་བརྒྱ་རྩ་བརྒྱད་བཟླས་བརྗོད་བྱ།
en: Having thus placed the bowls inside the maṇḍala, he should cover each of them with clean cloth and recite the Amogharāja one hundred and eight times.

source: ཁྲོ་བོའི་རྒྱལ་པོ་བརྒྱ་རྩ་བརྒྱད་བཟླས་བརྗོད་བྱས་ནས་དབང་བསྐུར་བར་བྱ།
en: He should consecrate the bowls while reciting the Krodharāja mantra.

source: དབང་བསྐུར་བར་བྱས་ནས་ཀྱང་རིག་སྔགས་འཆང་གིས་དབང་བསྐུར་བར་བྱ།
en: After consecrating the bowls, he should then consecrate himself. “

source: དེ་ནས་དཀྱིལ་འཁོར་སྙིང་པོར་ནི། །འཇིག་རྟེན་དབང་ཕྱུག་མཆོད་བྱ་སྟེ། །བདུག་སྤོས་ལྔ་དག་དབུལ་བྱ་བ། །ཨ་ག་རུ་དང་ཙནྡན་དང་། །སྤྲྀ་ཀ་གུ་གུལ་དུ་རུ་སྐ། །མཆོད་ཡོན་སྣོད་ནི་ལྔ་དབུལ་ཞིང་།
en: He should then make offerings to the Lokeśvara in the center of the maṇḍala by burning the five kinds of incense—agarwood, sandalwood, fenugreek, bdellium, and olibanum—and by offering five bowls with argha water and another five filled with the five bali articles of various flavors.

source: །གཏོར་མ་ལྔ་ནི་དགང་བྱ་སྟེ། །རོ་ལྡན་སྣ་ཚོགས་དག་གིས་དགང་། །རོ་ལྡན་འབྲས་བུ་སྣ་ཚོགས་པའི། །གཏོར་མ་ཆ་ལྔ་དབུལ་བར་བྱ།
en: The bali should consist of five parts and include various tasty fruits.

source: །ཀུན་ཏུ་ཕྲེང་བ་ཉི་ཤུ་དང་། །མར་མེ་ཉི་ཤུ་ལྔ་དག་དང་། །སྤོས་ཀྱི་ཕྱི་མ་ལྔ་དག་དང་། །སྤོས་ཀྱི་ཆ་ལྔར་ཕྱེ་བས་བྱུག །འཕན་ཕྲན་ཉི་ཤུ་རྩ་ལྔ་གདགས།
en: He should place twenty garlands of flowers and twenty-five lamps around the maṇḍala, smear it with the fivefold fragrance, and sprinkle it with the five fragrant powders.

source: །ཚོན་རྩི་ལྔ་ཡིས་མཛེས་པར་བྱ།
en: It is also said that the maṇḍala should be adorned with twenty-five beautiful banners in five colors.

source: །གསེར་དང་དངུལ་གྱིས་གཡོགས་པ་ཡི། །བུམ་པ་གང་བ་ཉི་ཤུ་ལྔ། །རིན་པོ་ཆེ་ནི་ལྔ་གཞུག་གོ།
en: The vidyā holder should add twenty-five full jars covered with lids of silver and gold, and he should add the five types of jewels.

source: །སྒོ་བཞི་གྲྭ་བཞིར་བུམ་པ་བརྒྱད། །བརྒྱ་དང་ཉི་ཤུ་རྩ་ལྔ་ཉིད། །དཀྱིལ་འཁོར་མེ་ཏོག་འབྲས་ཡོས་དང་། །ཡུངས་ཀར་ཉིད་ཀྱིས་མངོན་པར་དགྲམ།
en: He should place eight jars in the four corners and at the four doors, strew the maṇḍala with one hundred and twenty-five flowers, and sprinkle it with parched rice and mustard seeds. “

source: །སློབ་དཔོན་བླ་མ་མཆོད་པ་ནི། །གོས་དང་སྣོད་དང་ཡོན་གྱིས་སོ། །ཐུབ་པ་འཇིག་རྟེན་དབང་ཕྱུག་ལྟར། །སྟོན་པའི་འདུ་ཤེས་བསྐྱེད་ནས་སུ། །དཀྱིལ་འཁོར་སློབ་དཔོན་མཆོད་བྱས་ནས།
en: He should worship his teacher and master with offerings of clothes, dishes of food, and money, imagining him to be the preceptor, the teacher, and a sage like the Lokeśvara, the master of the maṇḍala.

source: །དེ་ནས་དཀྱིལ་འཁོར་གཤེགས་པར་གསོལ།
en: When he finishes his worship he should dismiss him from the maṇḍala.

source: །དེ་ནས་ལས་རྣམས་བྱ་བ་ནི། །ཇི་ལྟར་ཡིད་ལ་སྣ་ཚོགས་བྱ། །དོན་ཡོད་ཆེན་པོའི་གཞལ་མེད་ཁང་།
en: He can henceforth perform any variety of activity that comes to mind, such as conjuring great amogha palaces.

source: །རིག་སྔགས་འཆང་གིས་རྟག་ཏུ་གསང་། །དེ་ཉིད་དངོས་གྲུབ་བསྒྲུབ་སླ་བ། །དེ་བཞིན་ནོར་བུ་སྨན་སྔགས་སོ། །དོན་འདི་ཤིན་ཏུ་བཀྲ་ཤིས་ཏེ།
en: If he always maintains secrecy, the attainment of the true accomplishment will be easy, including the mastery of the jewel mantra and the medicinal substances.

source: །མཁས་པ་མི་ཡིས་བྱ་བ་ཡིན།
en: The learned vidyā holder should do things that are virtuous.

source: །ཕྲ་མའི་ཚིག་ཀྱང་མི་བསྟེན་ཏེ། །བརྫུན་ནི་ནམ་ཡང་སྨ་མི་བྱ།
en: He should never engage in backbiting and never tell lies.

source: །འདི་ནི་བསྒྲུབ་པའི་དེ་ཉིད་དེ། །དེ་ལ་འགྲུབ་པ་ཐེ་ཙོམ་མེད།
en: He will then succeed in this practice; there can be no doubt about this. “

source: །འདིར་ནི་དཀྱིལ་འཁོར་བཤད་པར་བྱ།
en: Now I will describe the maṇḍala.

source: །ཀུན་ནས་གྲུ་བཞི་ལྷམ་པ་སྟེ། །གྲྭ་བཞི་ཆ་ནི་ལེགས་པར་དབྱེ། །ཀོ་ལའི་ཚད་དེ་ལེགས་པ་དང་།
en: It should have four equal sides, be symmetrical, well proportioned, and beautifully outlined, and have four corners and the surface area of a boat.

source: །སྣ་ཚོགས་ཚོན་གྱི་ཐིག་སྐུད་ཀྱིས།
en: This supreme maṇḍala should be measured out with a measuring thread and painted in various bright colors.

source: །དཀྱིལ་འཁོར་དམ་པ་ཐིག་གདབ་བོ། །དཀྱིལ་འཁོར་དབུས་ཀྱི་སྙིང་པོར་ནི། །འཁོར་ལོ་བཟང་པོ་བྲི་བར་བྱ། །དབུས་ཀྱི་ལྟེ་བར་པདྨ་ཡིས།
en: In the center of the maṇḍala, the vidyā holder should draw the supreme wheel, and in the nave at its center he should skillfully draw a lotus.

source: །འཁོར་ལོ་གསལ་བ་བྲི་བར་བྱ། །པདྨའི་སྙིང་པོ་གསེར་དང་ནི། །དངུལ་ལམ་ཙནྡན་ལས་བྱས་པ། །འབར་བར་འཇིག་རྟེན་དབང་ཕྱུག་བཞུགས།
en: Upon its pericarp he should place the figure of the Lokeśvara that is fashioned out of gold, silver, or sandalwood and blazes with light.

source: །འཁོར་ལོ་ཀུན་ཏུ་རྩིབས་དང་ནི། །མུ་ཁྱུད་དག་གིས་ཆ་དབྱེའོ།
en: Around the image he should mark the regular pattern of the spokes and the wheel’s rim. “

source: །དཀྱིལ་འཁོར་སྙིང་པོའི་གྲྭ་རྣམས་དེར། །ལྷ་ཡི་དབང་པོ་ཚངས་པ་དང་། །ཁྱབ་འཇུག་དབང་ཕྱུག་ཆེན་པོ་བྲི།
en: Inside the maṇḍala, he should draw the gods Indra, Brahmā, Viṣṇu, and Maheśvara in the four corners.

source: །ཀུན་ཏུ་ཁ་ཁྱེར་རྣམ་པ་དང་། །པདྨས་ཕྲེང་བ་རྣམས་བྱའོ།
en: Around the maṇḍala, he should draw a railing surrounded by a row of lotuses.

source: །དཀྱིལ་འཁོར་ཕྱི་རོལ་ཀུན་ཏུ་ནི། །རྟགས་དང་ཕྱག་རྒྱ་རྣམས་བྲི་སྟེ། །རྡོ་རྗེ་དགྲ་སྟ་མདུང་རྩེ་གསུམ། །རལ་གྲི་ཞགས་པ་ཐོ་བ་དང་། །གཤིན་རྗེ་བེ་ཅོན་པདྨ་གདུགས། །དབྱུག་ཏོ་མདའ་པོ་ཆེ་རྣམས་སོ། །གྲྭ་རྣམས་ཀུན་ཏུ་ཕྲེང་བ་དང་། །མེ་ཏོག་རྣམ་པ་སྣ་ཚོགས་དགྲམ།
en: Surrounding the outside the maṇḍala, he should draw rows of the following mudrā signs: vajras, tridents, battle axes, swords, nooses, hammers, rods of Yama, lotuses, parasols, maces, and javelins, all interspersed with various colorful flowers.

source: །སྒོ་སྒོ་དེར་ནི་དཀྱིལ་འཁོར་གྱི། །ལྷ་སྟེ་གཤིན་རྗེ་ཆུ་ལྷ་དང་། །ལུས་ངན་དང་ནི་གཞོན་ནུ་བྲི།
en: At each of the four doors he should draw, respectively, the maṇḍala deities Yama, Varuṇa, Kubera, and Kumāra.

source: །དཀྱིལ་འཁོར་གྲྭ་བཞི་རྣམས་སུ་ནི། །རྒྱལ་པོ་ཆེན་པོ་བཞི་པོ་དག །གོ་ཆ་ལེགས་པར་བགོས་པ་དང་། །ཁྲོ་བར་ལྟ་བ་འཇིགས་བྱེད་བྲི།
en: At the four corners he should draw the Four Great Kings wearing coats of mail, looking fierce, and inspiring fear.

source: །འདི་ནི་དཀྱིལ་འཁོར་མཆོག་ཡིན་ཏེ། །དཀྱིལ་འཁོར་གྱི་ནི་དགོས་པ་རྣམས།
en: This supreme maṇḍala should be executed to perfection, all its features meeting the standards as specified. “

source: །ལེགས་པར་ཡོངས་སུ་རྫོགས་པར་ནི། །རིག་སྔགས་ཇི་བཞིན་བསྟན་པ་ཡིན། །དེ་ནས་ལེགས་པར་ཁྲུས་བྱས་ལ། །གོས་གཙང་བགོས་པ་འཇིགས་མེད་པས། །སྨན་མཆོག་བཟུང་སྟེ་ལས་བྱའོ།
en: The skilled vidyā holder, thoroughly bathed and wearing clean clothes, should take hold of the supreme medicine and perform the rite.

source: །རྨོངས་པའི་དྲ་བ་སྣ་ཚོགས་དང་། །སྒྱུ་མ་ལྟ་བུའི་རྣམ་སྤྲུལ་པ། །གང་གིས་ངན་འགྲོ་ཐར་འགྱུར་བ། །སེམས་ཅན་ཀུན་ལ་བསྟན་པར་བྱ།
en: He will then display various illusory, mirage-like appearances that will save sentient beings from unhappy destinies in the lower realms.

source: །རྟག་ཏུ་དགའ་དང་དད་པ་དང་། །གུས་པ་དེ་ཉིད་ཐོབ་པར་འགྱུར།
en: They will obtain lasting happiness and develop true faith and respect.

source: །རིག་སྔགས་འཆང་གིས་བསྒྲུབ་པའི་མཆོག །དངོས་གྲུབ་དེ་ཉིད་ཐོབ་པར་འགྱུར།
en: The vidyā holder will realize the nature of reality and attain supreme accomplishment. “

source: །རིག་སྔགས་འཆང་གིས་སྔར་ཁྲུས་བྱས་ལ་རྫས་ཀྱི་དྲི་ཆབ་གཙང་མ་དོན་ཡོད་པའི་རྒྱལ་པོ་བརྒྱ་རྩ་བརྒྱད་བཟླས་བརྗོད་བྱ།
en: The vidyā holder should first bathe and then incant perfumed water containing the medicinal substance one hundred and eight times with the Amogharāja mantra.

source: ཙནྡན་གྱི་ཆུ་ལ་བརྒྱ་རྩ་བརྒྱད་བཟླས་བརྗོད་བྱས་ནས་སྐྲ་ཡན་ཆད་ཙམ་བྱུགས་ལ་ཚོད་ཟིན་པར་བསྐུས་ནས་ཁ་གདོང་བཀྲུ་བར་བྱའོ།
en: He should incant sandal-scented water one hundred and eight times, anoint himself with a layer the depth of a hair, and rinse his mouth with it.

source: །མིག་སྨན་ལ་བརྒྱ་རྩ་བརྒྱད་བཟླས་བརྗོད་བྱས་ནས་བསྐུས་ན་མིག་བཟང་བར་འགྱུར་རོ།
en: He should then incant the eye ointment one hundred and eight times and anoint his eyes with it; he will thus obtain the divine eye.

source: །བརྒྱ་རྩ་བརྒྱད་ཚང་བར་བཟླས་བརྗོད་བྱས་ནས་བདག་ཉིད་དང་ཕྱོགས་བཅུར་གཏོར་རོ།
en: He should recite the mantra the full one hundred and eight times and sprinkle his body and the ten directions.

source: །དེ་བཞིན་དུ་ཏིལ་མར་བརྒྱ་རྩ་བརྒྱད་བཟླས་བརྗོད་བྱས་ནས་སྐྲ་ཡན་ཆད་བསྐུ་བ་དང་། ཚོད་ཟིན་བར་བསྐུ་བ་དང་། ལུས་རྐང་མཐིལ་ཡན་ཆད་བསྐུའོ།
en: He should incant the oil one hundred and eight times and anoint his body, from the soles of the feet upward, with a layer the depth of a hair.

source: །ཡི་གེ་གཅིག་པོ་ཡིད་ལ་བྱ་བ་ལ་སེམས་བྱམས་པ་ཉིད་ལ་གནས་ནས་རྒྱལ་པོ་དང་། བཙུན་མོའི་སྒོ་འམ། སྐྱེ་བོའི་ནང་ངམ།
en: He should mentally repeat the one-syllable mantra and engender thoughts of loving kindness. “

source: འདུས་པ་ཆེན་པོའམ། དགེ་འདུན་གྱི་ནང་ངམ། ཚོགས་དང་ཕྲད་པའམ། དེ་བཞིན་དུ་གཞན་དག་ཀྱང་རུང་སྟེ། དེ་དག་ཐམས་ཅད་ཀྱིས་འཇིག་རྟེན་མགོན་པོའི་གཟུགས་དང་ཁ་དོག་ཏུ་མཐོང་ཞིག་སའི་སྟེང་ནས་རྐང་པ་ཁྲུ་གང་ཙམ་གྱིས་སྤགས་ཏེ་འདུག་ལ། ཇི་ལྟ་ཇི་ལྟར་འདུལ་བ་རྣམས་ཀྱི་དད་པ་དེ་ལྟ་དེ་ལྟར་གཟུགས་རྣམས་སྟོན་པར་བྱེད་དེ། རྒྱལ་པོའམ། འཁོར་ལོས་སྒྱུར་བའམ། མིའི་སེང་གེའམ། ཕག་གམ།
en: Subsequently, whether at the gate of a royal palace, in the royal harem, in the middle of a crowd, at a large gathering, in an assembly of monks, or anywhere else people gather, everyone will see the vidyā holder in the form and appearance of the Lord of the World, standing one cubit above the ground.

source: སྲེད་མེད་ཀྱི་བུར་སྟོན་པའམ། ཚངས་པའམ། སུམ་ཅུ་རྩ་གསུམ་གྱི་དབང་པོའམ། དབང་ཕྱུག་ཆེན་པོ་མིག་གསུམ་པའམ། གཞོན་ནུ་འམ། ཆུ་ལྷའམ། གཤིན་རྗེའམ། རྣམ་ཐོས་ཀྱི་བུའམ། དེ་བཞིན་དུ་རྒྱལ་པོ་ཆེན་པོ་བཞིའམ། ནག་པོ་ཆེན་པོའམ། དགའ་བྱེད་དབང་ཕྱུག་གམ། སེར་སྐྱའམ། གསང་བ་པའམ།
en: Depending on whom they feel devotion to, they will see him as a king or a wheel-holding monarch, or as Narasiṃha, Vārāha, Nārāyaṇa, Brahmā, the lord of the realm of Thirty-Three, the three-eyed Maheśvara, Kumāra, Varuṇa, Yama, or Vaiśravaṇa.

source: ལག་ན་རྡོ་རྗེ་སྟོབས་པོ་ཆེའམ། ནོར་བུ་བཟང་པོའི་བུའམ། གང་བ་བཟང་པོའམ། སྟོབས་ཀྱི་ལྷའམ། གར་མཁན་མཆོག་གམ།
en: Or they will see him as Mahākāla, Nandikeśvara, Piṅgala, the guhyaka Vajrapāṇi, Mahābala, Maṇibhadra, Pūrṇabhadra, Baladeva, Naḍakūbara, Vāyu, or as one of the ṛṣis. “

source: རླུང་ལྷའམ། དྲང་སྲོང་ཉིད་དེ་ཇི་ལྟར་གཟུགས་རྣམ་པ་སྣ་ཚོགས་ཡིད་ལ་བྱས་པ་ཐམས་ཅད་སྟོན་པར་བྱེད་དོ། །མེ་ཏོག་དང་། འབྲས་བུ་སྣ་ཚོགས་པ་ཉིད་འབྱུང་བར་བྱེད་དོ།
en: He will appear in any form a person may think of, and he will be able to conjure various flowers and fruits.

source: །དེ་བཞིན་དུ་དགེ་འདུན་གྱི་ནང་དུ་ཞུགས་ན་དེ་སངས་རྒྱས་ཀྱི་གཟུགས་དང་།
en: If he enters a gathering of monks, he will appear to them in the form of the Buddha.

source: གཟུགས་སྣ་ཚོགས་སུ་སྣང་ཞིང་གཞལ་མེད་ཁང་གི་རྣམ་པ་དག་ཀྱང་སྟོན་པར་བྱེད་དོ།
en: He will be able to conjure various palaces of different shapes at will.

source: །ཇི་ལྟར་འདོད་པར་འགྱུར་བ་ཡིད་ལ་བྱས་པ་དེ་ལྟར་གཟུགས་རྣམས་སྟོན་པར་བྱེད་དོ། །འཁོར་ཚོགས་པའམ། དགོན་པའམ།
en: The images he holds in his mind, such as maṇḍala designs, forests, or recreational parks, will appear accordingly.

source: འཆག་ས་དག་ཀྱང་སྨན་ནོར་བུ་དང་། གསང་སྔགས་ཀྱི་མཐུས་གཟུགས་སྣ་ཚོགས་སུ་སྟོན་པར་བྱེད་དོ།
en: They will appear by the power of the medicinal jewel and the mantra.

source: །འགྲོན་པོ་འབྲོག་གི་ནང་དུ་ཕྱིན་པ་ཉམ་ཐག་པ། འཇིགས་པ་མི་བཟད་པ།
en: They can appear to anyone, anywhere, who is afflicted by suffering, has no protector, or is without refuge.

source: ཆུ་མེད་པ། དགོན་པར་མགོན་མེད་པ། སྡུག་བསྔལ་དྲག་པོ་དེ་ལྟ་བུའི་ན་འདུ་ཆུད་པའི་སྐྱེ་བོ་སྡུག་པར་གྱུར་པ། སྐྱབས་མེད་པ། མགོན་མེད་པར་གྱུར་པ།
en: This would include anyone facing terrible danger in the middle of a forest, caught in a flood or famine, or out in the wilderness, and anyone suffering terrible pain. “

source: སྐྱོབ་པ་མེད་པ། དཔུང་གཉེན་མེད་པར་གྱུར་པ་ན་དེ་ལ་རིག་སྔགས་འཆང་གིས་ཕྱེ་མ་འདིས་ཕྱོགས་བཞིར་མཚམས་གཅད་པར་བྱ།
en: The vidyā holder should therefore use this powder to create a protective boundary spanning the four quarters.

source: ཕྱེ་མས་དཀྱིལ་འཁོར་གྱི་ཚུལ་དུ་རི་མོ་བྲིས་ལ་རིལ་བུ་ལྔ་དཀྱིལ་འཁོར་གྱི་དབུས་སུ་གཞག་གོ།
en: He should trace a line with the powder in the shape of a circle and place the five pills at the center of this maṇḍala.

source: །ཡུངས་ཀར་ལ་ཏིལ་མར་གྱི་རྒྱལ་པོས་བསྐུས་ལ་དོན་ཡོད་པའི་རྒྱལ་པོ་བརྒྱ་རྩ་བརྒྱད་བཟླས་བརྗོད་བྱ།
en: He should smear mustard seeds with the king of oils, incant them with the Amogharāja one hundred and eight times, and consecrate them by reciting the Krodharāja mantra one hundred and eight times.

source: ཁྲོ་བོའི་རྒྱལ་པོས་བརྒྱ་རྩ་བརྒྱད་བཟླས་བརྗོད་བྱས་ཏེ་དབང་བསྐུར་ནས་ཁྲོ་བོའི་རྒྱལ་པོ་ཧཱུྃ་ཞེས་བྱ་བས་ཕྱག་རྒྱ་བཅིངས་ལ་ས་ལ་བསྣུན་ཅིང་ཕྱོགས་བཞིར་གཏོར་བར་བྱ་བ་ཕྱག་རྒྱ་དང་ལྡན་པར་བྱས་པ་ཙམ་གྱིས་ཆུ་བཟང་པོ་རྣམ་པ་སྣ་ཚོགས་འབབ་ཅིང་རྫིང་འབྱུང་བར་འགྱུར།
en: He should then throw them to the ground and cast them in the four directions while reciting the mantra of Krodharāja, pronouncing hūṁ, and displaying the mudrā. “

source: ཚལ་དང་། ཉེ་བའི་ཚལ་དང་། མེ་ཏོག་དང་། འབྲས་བུ་སྣ་ཚོགས་དང་ལྡན་པའི་གཞལ་མེད་ཁང་འབྱུང་བར་འགྱུར། ཕྱེ་མའི་དཀྱིལ་འཁོར་དེ་ལས་གྲོང་ཁྱེར་དང་།
en: As soon as the mudrā is formed, a lotus lake filled with divine water of various qualities will appear along with a palace and various parks and gardens with flowers and fruit trees.

source: ཁང་བཟངས་འབྱུང་བར་འགྱུར། ཁྱིམ་གྱི་གནས་ལྔ་སྟོང་འབྱུང་བར་འགྱུར་ཞིང་བདེ་བ་དང་། ལོ་ལེགས་པ་དང་། ཉམས་དགའ་བ་དང་། སྐྱེ་བོ་དང་། མི་མང་པོས་གང་བ་འབྱུང་བར་འགྱུར།
en: In the center of the powder maṇḍala will appear a mansion with five thousand houses filled with many people living in comfort, plenitude, and happiness.

source: ཉོ་ཚོང་དང་། བ་ལང་དང་། མ་ཧེ་དང་། རྟ་དང་། གླང་པོའི་གནས་དག་འབྱུང་བར་འགྱུར། དགེ་སྦྱོང་དང་།
en: Shops and businesses will also appear, as will estates with cows, steers, buffalo, horses, and elephants.

source: བྲམ་ཟེ་དང་། ཚོང་པ་དང་། ཁྱིམ་དང་། ཁང་པ་བཟང་པོ་དག་འབྱུང་བར་འགྱུར་ཏེ། ཇི་སྲིད་དུ་བསམས་པ་དེ་སྲིད་དུ་འདུག་གོ།
en: Houses and estates of ascetics, brahmins, and merchants will appear and remain within the powder maṇḍala for as long as the vidyā holder wishes. “

source: །ཆུ་དང་ཡུངས་ཀར་ལ་ལན་བདུན་བཟླས་བརྗོད་བྱས་ནས་ཕྱོགས་བཞིར་གཏོར་ན་མི་སྣང་བར་འགྱུར་རོ།
en: If the vidyā holder incants mustard seeds in water seven times and casts them into the four directions, he will become invisible.

source: །ཡུངས་ཀར་དེ་གཡུལ་འགྱེད་པའི་ནང་དུ་གཏོར་ན་དཔུང་གི་ཚོགས་ཡན་ལག་བཞི་དང་ལྡན་པར་འབྱུང་བར་འགྱུར་ཏེ། དེས་ཕ་རོལ་གྱི་དམག་ཚོགས་དང་། དགྲ་འཇིགས་ཤིང་འཇོམས་པར་བྱེད་པ་ལས་རྒྱལ་བར་འགྱུར་རོ།
en: If he casts the mustard seeds while in the midst of a battle or a fight, a cavalry division will magically appear and crush the enemy army, remove the danger posed by it, and bring victory.

source: །གྲོང་ཁྱེར་གྱི་ཕྱོགས་བཞི་ཀུན་ཏུ་གཏོར་ན་གཏོར་བ་ཙམ་གྱི་མོད་ལ་འོབས་བཅད་ཅང་རབ་ཁ་ཁྱེར་གྱིས་བསྐོར་ལ་གྲོང་ཁྱེར་ཀུན་ཏུ་སྐྱེས་བུ་གོ་ཆ་བགོས་པ་དག་སྣང་བས་གྲོང་ཁྱེར་མནན་པའམ། གཙེ་བར་སུས་ཀྱང་མི་ནུས་སོ།
en: If the vidyā holder casts the seeds in each of the four directions of a city, a protective ditch and palisade will appear surrounding the city as soon as the seeds are cast. The residents of the city will appear wearing full armor, and none will suffer any injury or harm. “

source: །མཚན་མོའི་དྲིའི་ཏིལ་མར་དེ་ཉིད་ཡུངས་ཀར་ལ་བསྐུས་ཏེ། བརྒྱ་རྩ་བརྒྱད་བཟླས་བརྗོད་བྱས་ནས་ཆད་པ་གང་མེའི་ནང་དུ་གཏོར། །ཆང་པ་གང་ཕྱོགས་བཞི་ཀུན་ཏུ་གཏོར་ན་ཀུན་ནས་མར་མེ་ཕྲེང་བ་འབྱུང་བར་འགྱུར་ལ།
en: If at night he smears the mustard seeds with fragrant oil, incants them one hundred and eight times with the mantra, and casts a fistful into the fire and a fistful into each of the four directions, a row of lights will appear around the city.

source: །ཇི་སྲིད་དགོས་པ་དེ་སྲིད་དུ་འབར་རོ། །གཙུག་ལག་ཁང་ངམ།
en: The lights will burn for as long as necessary.
